import React from "react";
import Box from "@material-ui/core/Box";
import Typography from "@material-ui/core/Typography";
import { makeStyles } from "@material-ui/core/styles";
import { Link } from "react-router-dom";
import "./Agreements.css";
import { useState } from "react";

function Copyright() {
  return (
    <Typography variant="body2" color="textSecondary" align="center">
      {"Copyright © "}
      <Typography>0123456789</Typography>
      <Typography>directmanpower@gmail.com</Typography>
      <Link color="inherit" to="/">
        www.yashirmanpower.com
      </Link>{" "}
      {new Date().getFullYear()}
      {"."}
    </Typography>
  );
}

const useStyles = makeStyles((theme) => ({
  container: {
    background: "#a8dadc",
    maxWidth: "96.2%",
    height: "100%",
  },
}));

const Agreements = () => {
  const [agreemantTitle, setAgreementTitle] = useState("Cheif");
  const [price, setPrice] = useState("10");
  const [mystyle, setMyStyle] = useState("");
  const date = new Date()
  

  const hamdleclick = (title, price, style) => {
    setAgreementTitle(title);
    setPrice(price);
    setMyStyle(style);
    
  };
  return (
    <div className="content">
      <div className="topaboutus">
        <div className="topcontent">
          <p className="title"> Agreements</p>
          <h3>We make the agreements easier and clear for you</h3>
          <p>We Are Here For You!</p>
          <p> Please Read It Carfuly And Be Sure To Understand Everything</p>
        </div>
        <div className="partners agreementscatogeries">
          <div
            className="partner proffisional"
            style={{ color: agreemantTitle == "Cheif" ? mystyle : null }}
            onClick={(e) => hamdleclick("Cheif", 90, "red")}
          >
            Cheif
          </div>
          <div
            className="partner proffisional"
            style={{ color: agreemantTitle == "Cooker" ? mystyle : null }}
            onClick={(e) => hamdleclick("Cooker", 90, "red")}
          >
            Cooker
          </div>
          <div
            className="partner proffisional"
            style={{ color: agreemantTitle == "Mensar" ? mystyle : null }}
            onClick={(e) => hamdleclick("Mensar", 80, "red")}
          >
            Mensar
          </div>
          <div
            className="partner proffisional"
            style={{ color: agreemantTitle == "Stewar" ? mystyle : null }}
            onClick={(e) => hamdleclick("Stewar", 70, "red")}
          >
            Stewar
          </div>
          <div
            className="partner proffisional"
            style={{ color: agreemantTitle == "Cleaner" ? mystyle : null }}
            onClick={(e) => hamdleclick("Cleaner", 70, "red")}
          >
            Cleaner
          </div>
          <div
            className="partner proffisional"
            style={{ color: agreemantTitle == "Prepration" ? mystyle : null }}
            onClick={(e) => hamdleclick("Prepration", 80, "red")}
          >
            Prepration
          </div>
        </div>
      </div>
      <div className="middlepage agreement">
        <h3>
          {agreemantTitle} Agreements {price}
        </h3>
        <div>
          <h3 style={{ textAlign: "center" }}>
            הסכם למתן שירותים אשר נערך ונחתם ב _תל אביב—--2022 15
          </h3>
          <h5>
            מצד אחד; יעוץ הגירה איי בי בע"מ 515757250 (ישיר שירותי כח אדם)
            מדרך שוקן 23, ת"א 
          </h5>
          <h5>בין: יום טוב 15 תייא</h5>
          <h5>
            בעיים תודהש בע''מ: 515587013 youremail@gmail.com מצד שני; הואיל
            והחברה עוסקת במתן(להלן "הלקוח")
          </h5>
         
          שירותים מנוהלים, בשירותי "מיקור חוץ" ובניהול פרויקטים; והואיל והלקוח
          מעוניין לקבל מהחברה שירותים כמפורט בנספח "א" להסכם זה, הכל בהתאם
          לתנאים מפורטים בהסכם זה ובנספחיו (להלן "ההסכם"); והואיל והצדדים
          מעוניינים לעגן את זכויותיהם והתחייבויותיהם ההדדיות לפי הוראות הסכם זה
          להלן; לפיכך הוסכם, הוצהר והותנה בין הצדדים כדלקמן: מבוא, נספחים
          וכותרות המבוא להסכם זה והנספחים המצורפים לו מהווים חלק בלתי נפרד ממנו.
          כותרות הסכם זה נערכו לשם הנוחות וההתמצאות בלבד, ואין לעשות בהן כל
          שימוש לצרכי פרשנות הסכם זה. הנספחים להלן מצורפים להסכם זה: נספח א' –
          פירוט השירותים והתמורה. הצהרות והתחייבויות החברה החברה מצהירה, מאשרת
          ומתחייבת כדלקמן: כי היא מנהלת ותנהל את עסקה בהתאם להוראות כל דין לרבות
          הוראות חוק, חוקי מגן, צווי הרחבה, הסכמים קיבוציים, הסדרים הנהוגים
          והמקובלים וכי תעסיק את עובדיה על פי כל דין. כמו כן היא מתחייבת לעמוד
          בדרישות החוק, כלשונן וכרוחן וכפי שישתנו מעת לעת, בכל הנוגע לקיום
          התחייבויותיה בקשר עם ביצוע הסכם זה. השירותים יינתנו ברמה מקצועית
          ובהתאם לסטנדרטים מקובלים, והכל על ידי כוח אדם מקצועי ומיומן בעל
          הכישורים, הניסיון והידע הנדרשים לביצוע התחייבויותיו על פי ההסכם. אין
          כל מניעה חוקית, מקצועית, כלכלית או אחרת לקיום כל התחייבויות החברה לפי
          הסכם זה, וכי אין בחתימתה על הסכם זה וביצוע השירותים על פיו משום הפרת
          כל דין. החברה תפעל על פי הנחיות הלקוח ובכפוף להוראות ההסכם. החברה תהיה
          אחראית לתשלום שכרם וכלל התשלומים המחויבים על פי דין ו/או הסכם לעובדי
          החברה. מתחייבת בזאת להגיש ללקוח בכל עת, על פי דרישת הלקוח, את כל
          האישורים והמסמכים שיתבקשו על ידה על מנת לוודא קיום הוראות הסכם זה. אין
          בסעיף זה כדי לגרוע מאחריות החברה או כדי להטיל חבות כלשהי על הלקוח.
          ידוע ומוסכם על החברה ללא סייג כי הלקוח יהיה רשאי לקלוט כל אחד מעובדי
          החברה, ולהתקשר עמם כעובדי הלקוח בכל עת ולכל דבר ועניין, והכל בתנאי
          הסכם זה להלן. הצהרות הלקוח הלקוח מצהיר, מאשר ומתחייב כדלקמן: אין כל
          מניעה חוקית, כספית, משפטית, חוזית, מנהלית ו/או אחרת המונעת ממנו להתקשר
          עם החברה בהסכם זה. הלקוח יקצה כוח אדם מקצועי אשר יהיה זמין ואחראי על
          מתן מענה מקצועי לפניות החברה בכל הנוגע למתן השירותים. הלקוח יהיה אחראי
          (א) למקום העבודה בו יתבצעו השירותים בהתאם לדרישות העיקריות בנספח א'.
          דרישות סבירות נוספות יתואמו באישור הלקוח ויהיו כפופות לאישורו. (ב)
          להקצות ציוד הנדרש לעובדי החברה, ובכלל זה _______________
          ______________________________ וכל ציוד נוסף כפי שיידרש לעובדי החברה
          בקשר לביצוע השירותים. כמו כן הלקוח ידאג לתקינות הציוד, על חשבונו, במשך
          כל תקופת ההסכם. ההתקשרות: החברה תספק ללקוח את השירותים על פי הסכם זה,
          על פי הפירוט ובהיקפים המפורטים בנספח א' להסכם זה. החברה תעמיד לרשות
          הלקוח עובדים על פי הדרישה המקצועית של הלקוח. הלקוח שומר לעצמו את הזכות
          לבצע סינון ולערוך מיונים למועמדים אשר יוצעו על ידי החברה בכל דרך
          מקובלת שתראה לנכון (ראיונות, מבדקים וכיו"ב). עובדי החברה, יועסקו בכפוף
          לאמור להלן, ע"י החברה, יתנו שירות מטעמה ללקוח, ויחסי עובד-מעביד וכל
          החובות החלים על המעביד כלפי עובדיו, יחולו בין עובדי החברה אלו לבין
          החברה בלבד. עובדי החברה לא יהיו זכאים לכל תשלום מהלקוח בקשר למתן
          שירותים לפי הסכם זה או סיום ההסכם עם החברה או מכל סיבה אחרת. במשך
          תקופת ההסכם יחולו על עובדי החברה כל הכללים, הנהלים וההנחיות שייקבעו על
          ידי הלקוח מפעם לפעם והחברה מקבלת על עצמה לדאוג לכך שעובדי החברה ינהגו
          על פיהם ויבצעו אותם באופן שייקבע ויידרש על ידי הלקוח לרבות שעות מתן
          השירותים בשעות המקובלות אצל הלקוח. החברה מתחייבת, כי עם קבלת הודעה
          מהלקוח בדבר אי שביעות רצון מרמת ביצוע השירותים, תפעל החברה באופן מיידי
          למילוי דרישות הלקוח. הלקוח מצידו מתחייב להודיע להחברה על כל תקלה במתן
          השירותים על ידי עובדי החברה ו/או אי שביעות רצון מהשירותים. הלקוח יהיה
          רשאי להודיע להחברה לגבי כל עובד החברה הנותן אצלה שירותים, שאינה מרוצה
          מעבודתו והחברה תהיה מחוייבת להחליפו בעובד אחר, כאשר הלקוח מודע לכלל
          הוראות חוקי ודיני העבודה הכרוכים בכך (חוק הודעה מוקדמת לפיטורים
          ולהתפטרות, תשס"א-2001 וכו'. במקרה זה _____________________________.
          הלקוח ימנה נציג לצורך ביצועו של הסכם זה, אשר יהיו מוסמך לייצגו בכל דבר
          ועניין הנוגע להסכם זה ולביצועו. נציג הלקוח יהיה מר/גב'
          ______________________. התמורה בתמורה לאספקת השירותים ללקוח בהתאם
          לנספח א' וקיום התחייבויותיה של החברה כאמור בהסכם זה, ישלם הלקוח להחברה
          את התמורה המפורטת בנספח זה . החברה תנפיק ללקוח חשבונית בגין התמורה
          לאחר שהלקוח תשלך את שעות העובד מסודר. כל תשלום של התמורה ישולם להחברה
          תוך 3 יום מיום החשבונית. לתמורה יתווסף מע"מ כדין. התמורה האמורה אינה
          כוללת כל תוספת או שינוי מעבר לפעילות עליה הוסכם בנספח א'. שינויים
          בהיקף השירותים יבוצעו אך ורק באישור מראש ובכתב של הצדדים, ובמקרה של
          הסכמה על השינויים כאמור – תוך עדכון נספח א' ושינוי התמורה, היה
          ונדרשים, בהתאם להוראות הסכם זה. בכל מקרה של איחור בתשלום, העולה על 7
          יום מן המועד המקורי בו היה אמור התשלום להתקבל אצל החברה, שמורה להחברה
          הזכות לגבות ריבית פיגורים בשיעור הריבית החריגה שתהא נהוגה באותה עת
          בבנק לאומי לישראל לגבי חשבונות חח"ד, החל מהיום הראשון לאיחור וזאת מבלי
          לגרוע מכל זכות או סעד אחר העומדים לרשותו על פי הדין ו/או ההסכם במגבלות
          הסעדים שבהסכם זה. מובהר בזאת, כי התמורה על פי הסכם זה הינה התמורה
          הסופית הכוללת והבלעדית והיא כוללת, בין היתר, את כל ההוצאות בגין כוח
          האדם שיועסק על ידי החברה לצורך מתן השירותים, כל מס, ו/או אגרה, למעט
          מע"מ, הוצאות ביטוח וכן את כל הוצאות החברה בקשר עם קיום התחייבויותיה
          לפי ההסכם. אחריות וביטוח הלקוח ידאג לאספקת סביבת עבודה בטוחה ובטיחותית
          ויהיה אחראי, כי אזור מתן השירותים יהא תקין ובטיחותי כדין, לרבות על פי
          פקודת הבטיחות בעבודה. במסגרת ההוראות הניתנות לנותני השירותים והמשימות
          המוטלות עליהם, יהיה אחראי הלקוח לכך שההוראות והמשימות יתאימו להכשרה
          המקצועית, ההסמכות והרישיונות המצויים בידי נותן השירות. הלקוח ידאג
          לקיומו של ביטוח אחריות כלפי צד שלישי במהלך כל תקופת ההסכם, וכן לכל
          ביטוח אחר נדרש בנוגע לשירותים. החברה כוח אדם תדאג לקיום ביטוח לכיסוי
          אחריותה כלפי צד שלישי וחבות מעבידים במהלך כל תקופת הסכם זה. החברה תהיה
          אחראית לנזקים ישירים בלבד שיגרמו ללקוח. החברה לא תהיה אחראית ולא תשא
          בנזקים כלשהם שיגרמו ללקוח ו/או לצד שלישי כלשהו, כתוצאה מאובדן הכנסה,
          רווח מנוע, אובדן נתונים ולכל נזק תוצאתי ו/או עקיף ו/או מקרי ו/או
          לנזקים שנגרמו כתוצאה מנסיבות של כוח עליון. הגבלת האחריות האמורה לגבי
          נזק או לפיצויים מסוג כלשהו ולכל חבות כספית (כולל השבה) תחול לגבי כל
          תביעה מכל סוג שהוא, תהא עילה אשר תהא, בין חוזית, בין נזיקית ובין אחרת.
          תקרת אחריותה של החברה ע"פ הסכם זה, תהיה גובה התמורה החוזית ששולמה
          בפועל בגין ההסכם עד למועד היווצרות העילה או גובה התמורה החוזית ששולמה
          בפועל במשך 12 החודשים האחרונים עד למועד היווצרות העילה, לפי הנמוך מבין
          השניים. תוקף ההסכם, סיום ההסכם, סעדים ותרופות תום ההתקשרות תעשה ע"י
          הודעת אחד הצדדים לצד השני, בהודעה הכתב ובהתראה בת 30 יום. אין בכל
          תרופה וסעד הנקובים במפורש בהסכם זה כדי ליתר ו/או לגרוע מזכות כל צד
          לתרופה וסעד אחרים הנתונים לו על-פי ההסכם ו/או על פי כל דין, אלא אם
          נקבע אחרת ובמפורש בהסכם. למעט אם נאמר אחרת בהסכם זה, כל צד להסכם יהיה
          זכאי לסיים הסכם זה, ע"י מתן הודעה מוקדמת בת 14 ימים בכתב למשנהו, בקרות
          אחד האירועים הבאים (או יותר): במקרה שהצד השני הפר הוראה מהוראות החוזה,
          והפרה זו לא תוקנה על-ידו בתוך 7 יום ממועד קבלת הודעה לעניין זה מהצד
          הנפגע. הוגשה בקשה לפירוק זמני ו/או קבוע של הצד השני ו/או לכינוס נכסי
          הצד השני או חלק מהם ו/או למינוי מפרק זמני או קבוע לצד השני ו/או למינוי
          כונס נכסים זמני ו/או קבוע לצד השני ו/או למינוי מנהל מיוחד לצד השני
          ו/או הוחל במשא ומתן לקראת הסדר לטובת נושי הצד השני או דיון בהסדר כזה,
          והכל אם הבקשה או המשא ומתן לא בוטלו או הוסרו או הפסקו, לפי העניין, תוך
          14 יום או במועד בו התנהל דיון בעניין בפני ביהמ"ש המוסמך במעמד הצד
          השני, והבקשה ו/או הצו לא הוסרו, לפי המוקדם מבניהם. הוטל צו עיקול כנגד
          מרבית נכסי הצד השני ו/או נפתחו הליכי הוצאה לפועל ביחס למרבית נכסי הצד
          השני ואלו לא הוסרו בתוך 14 יום ממועד הטלתם או פתיחתם, לפי העניין, או
          במועד בו התנהל דיון בעניין בפני ביהמ"ש המוסמך במעמד הצד השני, והבקשה
          ו/או הצו לא הוסרו, לפי המוקדם מבניהם. למען הסר ספק מובהר בזאת, כי סיום
          ההסכם או פקיעתו או ביטולו, מכל סיבה שהיא, לא יפגע בזכויות הצדדים
          שעילתם נוצרה לפני אותו מועד. במקרה של מתן הודעת סיום, החברה תמשיך לתת
          את השירותים במשך תקופת ההודעה, אלא אם יודיע הלקוח להחברה, כי הוא מוותר
          על מתן השירותים בתקופת ההודעה. העדר יחסי עובד מעביד הצדדים מצהירים, כי
          החברה הינה בבחינת "קבלן עצמאי" וכי אין בהסכם זה או בתנאי מתנאיו משום
          יצירת יחסי עובד מעביד בין החברה ו/או מי מטעמה לבין הלקוח. כמו כן,
          הצדדים מצהירים כי אין בהסכם זה ו/או בתנאיו דבר אשר יש בו כדי ליצור
          ו/או להוות קשר של שותפות, מיזם משותף, ו/או סוכנות בין הצדדים. מובהר
          ומוסכם כי המועסקים על-ידי החברה ו/או מי מטעמה, יחשבו בכל תקופת הסכם,
          עובדיה של החברה, ולא יהיה בין מי מהם לבין הלקוח יחסי עובד מעביד אלא אם
          כן, יהיה מעוניין הלקוח בקליטתו של העובד תחת העסקתו הישירה, שאז יחולו
          על הלקוח כל חובות מעסיק כלפי עובד, החל ממועד תחילת העסקתו אצל הלקוח.
          הלקוח מתחייב שלא לנהוג מנהג מעביד בעובדי החברה, פרט למתן הוראות
          מקצועיות לצורך ביצוע שירותים נשוא הסכם זה, ככל שידרשו. החברה תשפה
          ותפצה את הלקוח בגין כל סכום שהלקוח יחויב לשלם למי מן העובדים עקב או
          בזיקה לקביעה שיפוטית הסותרת את הוראות סעיף 8.1 ו/או 8.2 לעיל, ובתנאי
          שהלקוח יודיע להחברה על דבר התביעה מייד עם קבלתה ו/או דרישה או תלונה
          בעניין, ויאפשר להחברה לנהל את ההגנה כנגדן, ולא יתפשר ללא הסכמת החברה
          מראש ובכתב. הלקוח לא יהא רשאי להעסיק, במישרין או בעקיפין, מי מעובדי
          החברה או מי מטעמה שיועסקו במתן השירותים, בתקופת ההתקשרות בין הצדדים.
          יובהר, כי החברה לבדה תהיה המעבידה של כל אחד מעובדי החברה הנותנים
          שירותים על פי הסכם זה לכל דבר ועניין. החברה תנפיק תלושי שכר, תשלם על
          חשבונה את שכר העובדים, תבצע ניכויים למס הכנסה, ביטוח לאומי, ביטוח
          בריאות ו/או כל מס אחר החל על מעסיקים, וכן תישא בעלות התשלום של כל
          התנאים הסוציאליים להם זכאים העובדים (פיצויי פיטורים, דמי הבראה, דמי
          מחלה, ימי חופשה, נסיעות וכיו"ב), בהתאם לכל דין. סודיות החברה מתחייבת
          בזה כלפי הלקוח:- לשמור בסוד כל המצאה, פטנט, תוכנה, ידע ו/או מידע, know
          how וסוד מקצועי של הלקוח ו/או לקוחותיו, אשר נמסרו ו/או ימסרו לה על ידי
          הלקוח או יגיעו לידיעתה במסגרת ביצוע השירותים על פי הסכם זה. לא למסור
          ו/או לפרסם פרטים על עבודת הלקוח, תוכניותיו, נהליו ועסקיו לכל גוף ו/או
          אדם אחר כלשהו ולא להשתמש בהם בכל דרך ואופן שהם. להחזיר ללקוח עם סיומו
          של הסכם זה, כל חומר ומידע שנמסר להחברה במסגרת ההסכם. ההתחייבויות דלעיל
          לא יחולו על מידע שחובה לגלותו על פי דין, מידע שהינו או הפך נחלת הכלל
          וכן מידע שהגיע לידי החברה מצד שלישי כלשהו. שונות מוסכם בזאת כי הצדדים
          יהיו רשאים בכל עת להסב את החוזה כולו או כל חלק ממנו את זכויותיו
          וחובותיו על-פי ההסכם, כולן או מקצתן, בכל דרך כפי שימצא לנכון. לבית
          המשפט המוסמך שמקום מושבו בתל אביב, תהא הסמכות המקומית הייחודית
          והבלעדית לדון בכל עניין הנוגע להסכם ו/או הנובע ממנו, ולכל בית משפט אחר
          מלבדו לא תהיה סמכות לדון בעניינים אלו. ויתור של צד לחוזה על זכותו לפי
          החוזה במקרה מסוים לא יהווה ויתור על זכות זו בכל מקרה אחר. אי עמידתו של
          צד לחוזה על זכותו לפי החוזה לא יהווה ויתור שלו על זכות זו. הסכם זה על
          נספחיו מבטא וממצה את זכויות וחובות הצדדים לגבי הנושאים והעניינים
          הנדונים בו, והוא מחליף ומבטל כל הצעה, מצג, הסכם, מסמך עקרונות, משא
          ומתן, זיכרון דברים וכל מסמך אחר, ששררו או הוחלפו, בין בכתב ובין בעל
          פה, בין הצדדים, בנושאים האמורים, קודם לחתימתו של הסכם זה. כתובות
          הצדדים לצורכי הסכם זה הן כמפורט במבוא לעיל. הודעה שתישלח בדואר תיחשב
          כאלו נמסרה לאחר עבור 72 שעות מעת מסירתה למשלוח בדואר רשום. ולראיה, באו
          הצדדים על החתום יעוץ הגירה איי בי בע"מ515757250
          __________________{date.getDay()+4}/{date.getMonth()+1}/{date.getFullYear()}_ ____________________{date.getDay()+4}/{date.getMonth()+1}/{date.getFullYear()} הלקוח
          החברה נספח א' להסכם תכולת העבודה: הספקת עובדים
          _________________________________________________________________
          _________________________________________________________________
          תמורה: הלקוח ישלם את עלות שכר העבודה של העובד ובתוספת עלויות מעסיק
          ודמי שירות כדלקמן: בגין העסקת העובדים, המקדם כולל - ביטוח לאומי, חבות
          מעבידים, חופשה (עפ"י חוק), מימון, ביטוח מנהלים/קרן פנסיה ודמי שירות.
          על מחיר זה יתווסף מע"מ. בגין כל תשלום נוסף הנדרש לשלם לעובדים על פי
          חוק או עפ"י בקשת הלקוח (שעות נוספות, נסיעות, הבראה, תמורת הודעה
          מוקדמת, מחלה וימי חג לעובד שעתי וכו') . בהתאם לאמור – מחיר עבור כל שעת
          עבודה {price} בתוספת מע"מ כולל שעות נוספת+213ש"ח נסיעות. ולראיה, באו
          הצדדים על החתום יעוץ הגירה איי בי בע"מ515757250
          ___________________ {date.getDay()+4}/{date.getMonth()+1}/{date.getFullYear()} ____________________{date.getDay()+4}/{date.getMonth()+1}/{date.getFullYear()} הלקוח
          החברה
        </div>
        <button className="buttom">Next</button>
      </div>

      <Box mt={0}>
        <Copyright />
      </Box>
    </div>
  );
};

export default Agreements;
